Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SpaceSeparationLinesOverlap { get; }
  Visual Basic
Public Shared ReadOnly Property SpaceSeparationLinesOverlap As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SpaceSeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures OverlapFailures Class
  Autodesk.Revit.DB Namespace